.config/doom/config.org
#+title: Doom Emacs Config
#+author: John Dovern
#+property: header-args :tangle config.el :mkdirp yes
#+startup: hideblocks
#+options: ^:{} author:nil title:nill

* Table of Contents :toc:
- [[#general-notes][General Notes]]
  - [[#functions][Functions]]
- [[#packages][Packages]]
  - [[#emojify][Emojify]]
  - [[#org-auto-tangle][Org-auto-tangle]]
- [[#settings][Settings]]
  - [[#auto-revert][Auto revert]]
  - [[#cc-configuration][C/C++ configuration]]
  - [[#doom-dashboard][Doom dashboard]]
  - [[#org-modules][Org-modules]]
  - [[#trash-files][Trash files]]
  - [[#misc][Misc.]]
- [[#keymaps][Keymaps]]
  - [[#leader-key][Leader key]]
  - [[#buffers][Buffers]]
  - [[#ibuffer][Ibuffer]]
  - [[#dired][Dired]]
  - [[#dired-peep][Dired peep]]

* General Notes
This config uses ',' as the leader key and 'SPC' as the
local leader. Now on with the show!

** Functions
Please see funcs.org for more info
#+begin_src emacs-lisp
(load! "funcs.el")
#+end_src

* Packages
** Emojify
#+begin_src emacs-lisp
(use-package! emojify
  :hook (after-init . global-emojify-mode))
#+end_src

** Org-auto-tangle
#+begin_src emacs-lisp
(use-package! org-auto-tangle
  :defer t
  :hook (org-mode . org-auto-tangle-mode)
  :config
  (setq org-auto-tangle-default t))
#+end_src

* Settings
** Auto revert
See docs [[info:emacs#Auto Revert][here]]
#+begin_src emacs-lisp
(global-auto-revert-mode 1)
(setq global-auto-revert-non-file-buffers t)
#+end_src

** C/C++ configuration
Some retarded settings for C/C++ mode. See [[my-c++-mode-hook]]
for more info.
#+begin_src emacs-lisp
(setq c-tab-always-indent nil)
(defconst my-c++-style
  '("bsd"
    (c-basic-offset . 4)
    (c-offsets-alist . ((namespace-open . 0)
                        (innamespace . 0)
                        (label . 0)
                        (access-label . 0)
                        (inclass . +)
                        (substatement-label . 0)
                        (case-lable . 0)))))
(defun my-c++-mode-hook ()
  (c-add-style "my-c++-style" my-c++-style)
  (c-set-style "my-c++-style")
  (setq! c-default-style "my-c++-style"
         lsp-ui-sideline-enable t
         c-basic-offset 4
         tab-width 4))
(add-hook! 'c++-mode-hook 'my-c++-mode-hook)
(c-add-style "my-c++-style" my-c++-style)
(setq! c-default-style "my-c++-style"
       lsp-ui-sideline-enable t
       c-basic-offset 4
       tab-width 4)
#+end_src

** Doom dashboard
#+begin_src emacs-lisp
(setq +doom-dashboard-pwd-policy "~/"
      fancy-splash-image "~/.config/doom/doom-emacs-dash.png")
#+end_src

** Org-modules
Some org modules are not loaded by default
#+begin_src emacs-lisp
(after! org (add-to-list 'org-modules 'ol-info))
#+end_src

** Trash files
#+begin_src emacs-lisp
(setq delete-by-moving-to-trash t
      trash-directory "~/.local/share/Trash/files/")
#+end_src

