.config/doom/config.el
(load! "funcs.el")

(use-package! emojify
  :hook (after-init . global-emojify-mode))

(use-package! org-auto-tangle
  :defer t
  :hook (org-mode . org-auto-tangle-mode)
  :config
  (setq org-auto-tangle-default t))

(global-auto-revert-mode 1)
(setq global-auto-revert-non-file-buffers t)

(setq c-tab-always-indent nil)
(defconst my-c++-style
  '("bsd" (c-offsets-alist . ((innamespace . 0)
                              (label . --)
                              (access-label . --)))))
(defun my-c++-mode-hook ()
  (c-add-style "my-c++-style" my-c++-style)
  (c-set-style "my-c++-style")
  (setq! c-default-style "my-c++-style"))
(add-hook! 'c++-mode-hook 'my-c++-mode-hook)
(c-add-style "my-c++-style" my-c++-style)
(setq! c-default-style "my-c++-style")
       ;; lsp-ui-sideline-enable t
       ;; c-basic-offset 4
       ;; tab-width 4)

(setq +doom-dashboard-pwd-policy "~/"
      fancy-splash-image "~/.config/doom/doom-emacs-dash.png")

(after! org (add-to-list 'org-modules 'ol-info))

(setq delete-by-moving-to-trash t
      trash-directory "~/.local/share/Trash/files/")
