.config/doom/config.org
** Misc.
Word wrapp
#+begin_src emacs-lisp
(setq +word-wrap-extra-indent nil)
#+end_src

Tree-sitter
#+begin_src emacs-lisp
(after! tree-sitter
  (global-tree-sitter-mode))
(setq +tree-sitter-hl-enabled-modes t)
#+end_src

#+begin_src emacs-lisp
;; (setq company-statistics-mode t)
(setq company-minimum-prefix-length 2
      company-idle-delay 0.0) ;; default is 0.2
#+end_src

#+begin_src emacs-lisp
(setq lsp-signature-doc-lines 5)
(setq +lsp-company-backends
      '(:separate company-files company-capf company-yasnippet company-dabbrev-code company-dabbrev))
(setq company-backends
      '((:separate company-files company-capf company-yasnippet company-dabbrev-code company-dabbrev)))
(add-hook! 'lsp-completion-mode-hook
           (setf (alist-get 'lsp-capf completion-category-defaults) '((styles . (basic)))))
#+end_src

#+begin_src emacs-lisp
;; (after! lsp-pylsp
;;   (setq lsp-pylsp-plugins-pydocstyle-ignore
;;         ["D100" ; Missing docstring in public module
;;          "D101"
;;          "D102"
;;          "D103" ; Missing docstring in public function
;;          "D105"
;;          "D107"
;;          "D212" ; Multi-line docstring summary should start at the second line
;;          "D413" ; Missing blank line after last section
;;          "D401" ; First line should be in imperative mood
;;          "D403"]
;;         lsp-pylsp-plugins-rope-autoimport-enabled t
;;         lsp-pylsp-plugins-jedi-completion-include-params nil))
#+end_src


#+begin_src emacs-lisp
(modify-syntax-entry ?_ "w")
#+end_src

#+begin_src emacs-lisp
(setq undo-limit 80000000                         ; Raise undo-limit to 80Mb
      auto-save-default t                         ; Nobody likes to loose work, I certainly don't
      scroll-preserve-screen-position 'always     ; Don't have `point' jump around
      scroll-margin 5)                            ; It's nice to maintain a little margin
#+end_src

#+begin_src emacs-lisp
(setq evil-vsplit-window-right t
      evil-split-window-below t)
#+end_src

#+begin_src emacs-lisp
(setq org-roam-directory "~/ewiki")
#+end_src

#+begin_src emacs-lisp
(setq +workspaces-main "master")
#+end_src

#+begin_src emacs-lisp
(after! org-roam
  (setq org-roam-capture-templates
        '(("d" "default" plain "%?"
           :target (file+head "%<%Y%m%d%H%M%S>-${slug}.org" "#+title: ${title}\n")
           :unnarrowed t)
          ("n" "ncmpcpp" plain "\n\n* ${title}\n%?"
           :target (file+head "%<%Y%m%d%H%M%S>-${slug}.org"
                              "#+title: ${title}\n#+filetags:\"ncmpcpp_notes\" \"${title}\" \"ncurses\"\n#+startup: show2levels")
           :unnarrowed t))))
#+end_src

#+begin_src emacs-lisp
(setf (alist-get '(markdown-mode org-mode org-roam-mode) +spell-excluded-faces-alist)
      '(markdown-code-face
        markdown-reference-face
        markdown-link-face
        markdown-url-face
        markdown-markup-face
        markdown-html-attr-value-face
        markdown-html-attr-name-face
        markdown-html-tag-name-face))
#+end_src

#+begin_src emacs-lisp
;; With dired-open plugin, you can launch external programs for certain extensions
;; For example, I set all .png files to open in 'sxiv' and all .mp4 files to open in 'mpv'
(setq dired-open-extensions '(("gif" . "nsxiv")
                              ("jpg" . "nsxiv")
                              ("png" . "nsxiv")
                              ("pdf" . "sioyek")
                              ("mkv" . "mpv")
                              ("mp4" . "mpv")))
#+end_src

#+begin_src emacs-lisp
;; (setq doom-theme 'doom-one)
(setq doom-theme 'doom-kanagawa)
#+end_src

#+begin_src emacs-lisp
;; Get file icons in dired
(add-hook! 'dired-mode-hook
           'all-the-icons-dired-mode
           'dired-hide-details-mode)
#+end_src

#+begin_src emacs-lisp
(setq doom-font (font-spec :font "Monospace" :size 18)
      doom-big-font (font-spec :font "Monospace" :size 36)
      doom-variable-pitch-font (font-spec :font "Sans" :size 18)
      doom-unicode-font (font-spec :font "Monospace" :size 18)
      doom-serif-font (font-spec :font "Monospace" :size 18))
#+end_src

#+begin_src emacs-lisp
(after! doom-themes
  (setq doom-themes-enable-bold t
        doom-themes-enable-italic t
        doom-themes-treemacs-enable-variable-pitch nil
        doom-themes-treemacs-theme 'doom-kanagawa
        doom-kanagawa-brighter-comments t
        doom-one-light-brighter-comments t
        doom-one-brighter-comments t))
#+end_src

#+begin_src emacs-lisp
(after! treemacs
  (setq! treemacs-width 20
         treemacs-show-cursor t))
#+end_src

#+begin_src emacs-lisp
(custom-set-faces!
  '(font-lock-comment-face :slant italic))
#+end_src

#+begin_src emacs-lisp
(setq display-line-numbers-type 'relative)
#+end_src

#+begin_src emacs-lisp
(set-face-attribute 'mode-line nil :font "Monospace")
#+end_src

#+begin_src emacs-lisp
(setq doom-modeline-height 25     ;; sets modeline height
      doom-modeline-bar-width 5   ;; sets right bar width
      doom-modeline-persp-name t  ;; adds perspective name to modeline
      doom-modeline-persp-icon t) ;; adds folder icon next to persp name
#+end_src

#+begin_src emacs-lisp
(xterm-mouse-mode 1)
#+end_src

#+begin_src emacs-lisp
(setq shell-file-name "/bin/zsh"
      vterm-max-scrollback 5000)
#+end_src

#+begin_src emacs-lisp
(setq eshell-aliases-file "~/.config/doom/eshell/aliases"
      eshell-history-size 5000
      eshell-buffer-maximum-lines 5000
      eshell-hist-ignoredups t
      eshell-scroll-to-bottom-on-input t
      eshell-destroy-buffer-when-process-dies t
      eshell-visual-commands'("bash" "htop" "ssh" "top" "zsh"))
#+end_src

#+begin_src emacs-lisp
(require 'dap-cpptools)
(require 'dap-lldb)
(require 'dap-gdb-lldb)
(setq dap-ui-locals-expand-depth t)
(setq dap-auto-show-output nil)
(add-hook 'dap-stopped-hook
          (lambda (arg) (call-interactively #'dap-hydra)))
#+end_src

#+begin_src emacs-lisp
(setq hscroll-margin 6)
#+end_src

#+begin_src emacs-lisp
(add-hook! 'conf-unix-mode-hook
  (when (stringp buffer-file-name)
      (when (string-match-p "/keysrc$" buffer-file-name)
          (add-hook! 'after-save-hook :local
            (shell-command-to-string "kill -SIGUSR1 \"$(pidof wkx)\"")))
      (when (string-match-p "/bindsrc$" buffer-file-name)
        (add-hook! 'after-save-hook :local
          (run-shell-command-split-window "wkx-update --binds")))
      (when (string-match-p "/keysrc$" buffer-file-name)
        (add-hook! 'after-save-hook :local
          (run-shell-command-split-window "wkx-update --keys")))
      (when (string-match-p "/wkxrc$" buffer-file-name)
        (add-hook! 'after-save-hook :local
          (run-shell-command-split-window "wkx-update --conf")))))
#+end_src

#+begin_src emacs-lisp
(add-to-list 'auto-mode-alist '("xresources" . conf-mode))
(add-hook! 'conf-mode-hook
  (when (stringp buffer-file-name)
    (when (string-match-p "/xresources$" buffer-file-name)
      (add-hook! 'after-save-hook :local
        (shell-command "xrdb \"$HOME/.config/x11/xresources\"")))))
#+end_src

#+begin_src emacs-lisp
(add-hook! 'conf-unix-mode-hook
  (when (stringp buffer-file-name)
      (if (string-match-p "/dunstrc$" buffer-file-name)
          (add-hook! 'after-save-hook :local
            (shell-command-to-string "systemctl --user restart dunst.service")))))
#+end_src

#+begin_src emacs-lisp
;; (setq spell-fu-ignore-modes '(org-mode org-roam-mode))
;; (after! (:or org org-roam)
(add-hook! '(org-mode-hook org-roam-mode-hook)
            #'auto-fill-mode
            (setq-local fill-column 60)
            (spell-fu-mode -1))
(add-hook! doom-switch-buffer
  (when (eq major-mode 'vterm-mode)
    (evil-collection-vterm-insert)))
;; (advice-add '+vterm/toggle :around
;;             (lambda (fn &rest args) (apply fn args)
;;               (when (eq major-mode 'vterm-mode)
;;                 (evil-collection-vterm-insert))))
#+end_src

* Keymaps
** Leader key
Remap leader key
#+begin_src emacs-lisp
(setq doom-leader-key ","
      doom-leader-alt-key "M-,"
      doom-localleader-key "SPC"
      doom-localleader-alt-key "M-SPC")
#+end_src

** Buffers
#+begin_src emacs-lisp
(map! :leader
      (:prefix ("b" . "buffer")
       :desc "List bookmarks" "L" #'list-bookmarks
       :desc "Save current bookmarks to bookmark file" "w" #'bookmark-save))
#+end_src

** Ibuffer
#+begin_src emacs-lisp
(evil-define-key 'normal ibuffer-mode-map
        (kbd "f c") 'ibuffer-filter-by-content
        (kbd "f d") 'ibuffer-filter-by-directory
        (kbd "f f") 'ibuffer-filter-by-filename
        (kbd "f m") 'ibuffer-filter-by-mode
        (kbd "f n") 'ibuffer-filter-by-name
        (kbd "f x") 'ibuffer-filter-disable
        (kbd "g h") 'ibuffer-do-kill-lines
        (kbd "g H") 'ibuffer-update)
#+end_src

