.config/doom/config.org
** Dired peep
#+begin_src emacs-lisp
(evil-define-key 'normal peep-dired-mode-map
  (kbd "j") 'peep-dired-next-file
  (kbd "k") 'peep-dired-prev-file)
(add-hook 'peep-dired-hook 'evil-normalize-keymaps)
#+end_src

#+begin_src emacs-lisp
(map! :leader
      :desc "Load new theme" "H t" #'consult-theme)
#+end_src

#+begin_src emacs-lisp
(map! :leader
      (:prefix ("r" . "registers")
       :desc "Copy to register" "c" #'copy-to-register
       :desc "Frameset to register" "f" #'frameset-to-register
       :desc "Insert contents of register" "i" #'insert-register
       :desc "Jump to register" "j" #'jump-to-register
       :desc "List registers" "l" #'list-registers
       :desc "Number to register" "n" #'number-to-register
       :desc "Interactively choose a register" "r" #'counsel-register
       :desc "View a register" "v" #'view-register
       :desc "Window configuration to register" "w" #'window-configuration-to-register
       :desc "Increment register" "+" #'increment-register
       :desc "Point to register" "SPC" #'point-to-register))
#+end_src


#+begin_src emacs-lisp
(map! :map dap-mode-map
      :leader
      (:prefix ("d" . "dap")
       ;; basics
       :desc "dap next"          "n" #'dap-next
       :desc "dap step in"       "i" #'dap-step-in
       :desc "dap step out"      "o" #'dap-step-out
       :desc "dap continue"      "c" #'dap-continue
       :desc "dap hydra"         "h" #'dap-hydra
       :desc "dap debug restart" "r" #'dap-debug-restart
       :desc "dap debug"         "s" #'dap-debug
       ;; debug
       (:prefix ("d" . "Debug")
        :desc "dap debug recent"  "r" #'dap-debug-recent
        :desc "dap debug last"    "l" #'dap-debug-last)
       ;; eval
       (:prefix ("e" . "Eval")
        :desc "eval"                "e" #'dap-eval
        :desc "eval region"         "r" #'dap-eval-region
        :desc "eval thing at point" "s" #'dap-eval-thing-at-point
        :desc "add expression"      "a" #'dap-ui-expressions-add
        :desc "remove expression"   "d" #'dap-ui-expressions-remove)
       ;; breakpoint
       (:prefix ("b" . "Breakpoint")
        :desc "dap breakpoint toggle"      "b" #'dap-breakpoint-toggle
        :desc "dap breakpoint condition"   "c" #'dap-breakpoint-condition
        :desc "dap breakpoint hit count"   "h" #'dap-breakpoint-hit-condition
        :desc "dap breakpoint log message" "l" #'dap-breakpoint-log-message)
       ;; debug
       (:prefix ("t" . "Template")
        :desc "dap edit template" "e" #'dap-debug-edit-template)))
#+end_src

#+begin_src emacs-lisp
(map! :leader
      (:prefix ("e" . "Eshell")
       :desc "Eshell" "e s" #'eshell
       :desc "Counsel eshell history" "e h" #'counsel-esh-history))
#+end_src

#+begin_src emacs-lisp
(map! :leader
      :desc "Vterm popup toggle" "t t" #'+vterm/toggle
      :desc "Open vterm" "t v" #'my-open-vterm)
#+end_src

#+begin_src emacs-lisp
(defun prefer-horizontal-split ()
  (set-variable 'split-height-threshold nil t)
  (set-variable 'split-width-threshold 40 t)) ; make this as low as needed
(add-hook 'markdown-mode-hook 'prefer-horizontal-split)
#+end_src

#+begin_src emacs-lisp
(map! :leader
      :prefix ("w". "window")
      :desc "Window enlargen" "i" #'doom/window-enlargen
      :desc "balance windows" "y" #'balance-windows)
#+end_src

#+begin_src emacs-lisp
(map! :leader
      :desc "Clone indirect buffer other window" "b c" #'clone-indirect-buffer-other-window)
#+end_src

#+begin_src emacs-lisp
(map! :leader
      (:prefix ("w" . "window")
       :desc "Winner redo" "<right>" #'winner-redo
       :desc "Winner undo" "<left>" #'winner-undo))
#+end_src

#+begin_src emacs-lisp
(map! :leader
      :desc "Zap to char" "z" #'zap-to-char
      :desc "Zap up to char" "Z" #'zap-up-to-char)
#+end_src

#+begin_src emacs-lisp
(defun my-c-hook-settings ()
  (setq-local +format-on-save-enabled-modes nil)
  (setq c-basic-offset 4))
(add-hook! '(c-mode-hook c++-mode-hook)
           #'my-c-hook-settings)
#+end_src

#+begin_src emacs-lisp
(map! :after evil
      :map evil-normal-state-map
      "ZZ"      #'doom/save-and-kill-buffer
      "ZQ"      #'kill-current-buffer)
#+end_src

#+begin_src emacs-lisp
(defun toggle-my-theme ()
  "Toggle light and dark themes"
  (interactive)
  (if (eq doom-theme 'doom-one)
      (load-theme 'doom-one-light t)
    (load-theme 'doom-one t)))
#+end_src

#+begin_src emacs-lisp
(map! :leader
      :desc "Previous workspace"         "TAB h" #'+workspace/switch-left
      :desc "Previous workspace"         "TAB l" #'+workspace/switch-right
      :desc "Toggle syntax highlighting" "t h"   #'tree-sitter-hl-mode
      :desc "Toggle treemacs"            "t r"   #'treemacs
      :desc "Toggle theme"               "t d"   #'toggle-my-theme)
#+end_src

#+begin_src emacs-lisp
(map! :leader
      :desc "Quit Emacs"   "q e" #'save-buffers-kill-terminal
      :desc "Delete frame" "q q" #'save-buffers-kill-emacs)
#+end_src

#+begin_src emacs-lisp
(map! :localleader
      :map org-mode-map
      (:prefix ("m" . "my maps")
       (:prefix ("e" . "export")
        :desc "Export to gfm" "g" #'org-pandoc-export-to-gfm
        :desc "Export as gfm" "G" #'org-pandoc-export-as-gfm)))
#+end_src

#+begin_src emacs-lisp
(map! :leader
      :desc "Toggle line numbers" "t L" #'doom/toggle-line-numbers
      :desc "Toggle lsp server (restart)" "t l" #'lsp-workspace-restart)
#+end_src

#+begin_src emacs-lisp
(evil-global-set-key 'insert (kbd "M-v") 'evil-paste-before)
(evil-global-set-key 'insert (kbd "C-e") 'evil-scroll-line-to-center)
#+end_src

#+begin_src emacs-lisp
(map! :after evil
      :map evil-normal-state-map
      "Q"       #'evil-fill-and-move)
#+end_src

#+begin_src emacs-lisp
(defadvice! prompt-for-buffer (&rest _)
  :after '(evil-window-split evil-window-vsplit)
  (consult-buffer))
#+end_src

#+begin_src emacs-lisp
(map! :leader
      "h" nil
      :desc "Help" "H" help-map
      "h" #'evil-window-left
      "j" #'evil-window-down
      "k" #'evil-window-up
      "l" #'evil-window-right)
#+end_src

#+begin_src emacs-lisp
(map! :leader
      (:prefix ("TAB" . "workspace")
       "s" nil
       (:prefix ("s" . "switch")
        :desc "Switch to 1st workspace" "a" #'+workspace/switch-to-0
        :desc "Switch to 2nd workspace" "r" #'+workspace/switch-to-1
        :desc "Switch to 3rd workspace" "s" #'+workspace/switch-to-2
        :desc "Switch to 4th workspace" "t" #'+workspace/switch-to-3
        :desc "Switch to 5th workspace" "n" #'+workspace/switch-to-4
        :desc "Switch to 6th workspace" "e" #'+workspace/switch-to-5
        :desc "Switch to 7th workspace" "i" #'+workspace/switch-to-6
        :desc "Switch to 8th workspace" "o" #'+workspace/switch-to-7)
       :desc "Save to workspace file"     "S"   #'+workspace/save
       :desc "Switch to last workspace"   "TAB" #'+workspace/other
       :desc "Display tab bar"            "."   #'+workspace/display
       :desc "List workspaces"            "o"   #'+workspace/switch-to))
#+end_src

#+begin_src emacs-lisp
;; (map! :leader
;;       (:prefix ("r" . "roam")
;;        (:prefix ("n" . "node")
;;         :desc "Find node" "f" #'org-roam-node-find
;;         :desc "Insert node" "i" #'org-roam-node-insert)
;;        (:prefix ("l" . "links")
;;         :desc "Yank link" "y" #'org-store-link
;;         :desc "Paste link" "p" #'org-insert-link)))
#+end_src

#+begin_src emacs-lisp
(map! :leader
      :desc "Find node" "f n" #'org-roam-node-find
      "n l" nil
      (:prefix ("n" . "notes")
       (:prefix ("l" . "+links")
        :desc "Yank link"  "y" #'org-store-link
        :desc "Paste link" "p" #'org-insert-link)))
#+end_src

#+begin_src emacs-lisp
(map! :localleader
      (:prefix ("l" . "links")
       (:prefix ("r" . "references")
        :desc "URL"          "u" #'org-insert-link-from-clipboard
        :desc "ID"           "i" #'org-add-id-link
        :desc "ID +desc"     "I" #'org-add-id-link-desc
        :desc "Header"       "h" #'org-add-header-link
        :desc "Header +desc" "H" #'org-add-header-link-desc)))
#+end_src

#+begin_src emacs-lisp
(map! :leader
      :desc "Get files" "c g" (lambda () (interactive) (run-command-in-vterm "grep -R")))
#+end_src

#+begin_src emacs-lisp
;; close dap-output on exit
(add-hook 'dap-terminated-hook #'debug-cleanup-output)
(dap-register-debug-template
 "cpptools::Run"
 (list :type "cppdbg"
       :request "launch"
       :name "cpptools::Run"
       :MIMode "gdb"
       :program "${workspaceFolder}/"
       :cwd     "${workspaceFolder}"))
#+end_src

